IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM8_CONTROLSS_G1_EPWM8.xml
	<register id="CONTROLSS_G1_EPWM8_DECOMPSEL" acronym="CONTROLSS_G1_EPWM8_DECOMPSEL" offset="0x804" width="32" description="Used to configure the comparator whose trip sources will be used.">
		<bitfield id="TRIPH" width="6" begin="21" end="16" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPH 000010 : Input-XBAR[1] is the source of TRIPH . . 100000 : Input-XBAR[31] is the source of TRIPH 100001 : CMPSSA0 is the source of TRIPH 100010 : CMPSSA1 is the source of TRIPH . . 101010 : CMPSSA9 is the source of TRIPH 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPH 110010 : CMPSSB1 is the source of TRIPH . . 111010 : CMPSSB9 is the source of TRIPH 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPH being 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TRIPL" width="6" begin="5" end="0" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPL 000010 : Input-XBAR[1] is the source of TRIPL . . 100000 : Input-XBAR[31] is the source of TRIPL 100001 : CMPSSA0 is the source of TRIPL 100010 : CMPSSA1 is the source of TRIPL . . 101010 : CMPSSA9 is the source of TRIPL 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPL 110010 : CMPSSB1 is the source of TRIPL . . 111010 : CMPSSB9 is the source of TRIPL 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPL being 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DEACTCTL" acronym="CONTROLSS_G1_EPWM8_DEACTCTL" offset="0x808" width="32" description="Used to configure the PWM controls when in DE mode.">
		<bitfield id="TRIPENABLE" width="1" begin="16" end="16" resetval="0x0" description="0 : PWMTRIP does not bypass the diode emulation logic. 1 : PWMTRIP bypasses the diode emulation PWM generation logic [not complete bypass of module]" range="16" rwaccess="R/W"/> 
		<bitfield id="TRIPSELB" width="1" begin="6" end="6" resetval="0x0" description="0 : TRIPH 1 : TRIPL" range="6" rwaccess="R/W"/> 
		<bitfield id="PWMB" width="2" begin="5" end="4" resetval="0x0" description="00 : synchronized version of TRIPH or TRIPL signal as selected by the TRIPSELB 01 : synchronized and inverted version of TRIPH or TRIPL signal as selected by the TRIPSELB 10 : A constant 0 drives PWMB when DEACTIVE flag is set. 11 : A constant 1 drives PWMB when DEACTIVE flag is set." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="TRIPSELA" width="1" begin="2" end="2" resetval="0x0" description="0 : TRIPH 1 : TRIPL" range="2" rwaccess="R/W"/> 
		<bitfield id="PWMA" width="2" begin="1" end="0" resetval="0x0" description="00 : synchronized version of TRIPH or TRIPL signal as selected by the TRIPSELA 01 : synchronized and inverted version of TRIPH or TRIPL signal as selected by the TRIPSELA 10 : A constant 0 drives PWMA when DEACTIVE flag is set. 11 : A constant 1 drives PWMA when DEACTIVE flag is set." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DESTS" acronym="CONTROLSS_G1_EPWM8_DESTS" offset="0x80C" width="32" description="DE Status register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : Diode emulation mode is not active 1 : Diode emulation mode is active" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DEFRC" acronym="CONTROLSS_G1_EPWM8_DEFRC" offset="0x810" width="32" description="DE Status force register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Forces DEACTIVE flag to 1." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DECLR" acronym="CONTROLSS_G1_EPWM8_DECLR" offset="0x814" width="32" description="DE Status clear register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Clears DEACTIVE flag." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DEMONCNT" acronym="CONTROLSS_G1_EPWM8_DEMONCNT" offset="0x820" width="32" description="DE trip monitor counter">
		<bitfield id="CNT" width="16" begin="15" end="0" resetval="0x0" description="An 16-bit counter which monitors the frequency of diode mode trip events. When TripHorTripL is active:    Increment CNT [increment INCSTEP on every EPWMxSYNC] When TripHorTripL is in-active: Decrement CNT [decrement DECSTEP on every EPWMxSYNC] If[ CNT > THRESHOLD] then generate DETRIP and clear the counter. If[ [CNT - DECSTEP] &#38;#60; 0] then CNT = 0 If[ [CNT + INCSTEP] >= 0xFFFF] then CNT = 0xFFFF  Note : CNT is cleared when DECTL.ENABLE is 0 Note: DEMONTHRES == 0x0 should not generate trip as the DEMONTHRES and DEMONCNT registers have reset value of 0x0" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DEMONCTL" acronym="CONTROLSS_G1_EPWM8_DEMONCTL" offset="0x824" width="32" description="DE monitor mode control">
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Enable bit for DE Mode Monitor counter function. 0: DE Mode Monitor counter function is disabled 1: DE Mode Monitor counter function is enabled" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DEMONSTEP" acronym="CONTROLSS_G1_EPWM8_DEMONSTEP" offset="0x828" width="32" description="DE monitor counter step">
		<bitfield id="DECSTEP" width="8" begin="23" end="16" resetval="0x0" description="Defines the decrement step of DEMONCNT.CNT counter." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="INCSTEP" width="8" begin="7" end="0" resetval="0x0" description="Defines the increment step of DEMONCNT.CNT counter." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM8_DEMONTHRES" acronym="CONTROLSS_G1_EPWM8_DEMONTHRES" offset="0x82C" width="32" description="DE monitor counter threshold">
		<bitfield id="THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Defines the threshold of DE monitor counter. " range="15 - 0" rwaccess="R/W"/>
	</register>
